# WireSizes Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemperatureRatingType..::..WireSizes Property
TemperatureRatingType Class See Also
---
Get all electrical wire sizes defined in this temperature rating type and its corresponding material type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireSizeSet WireSizes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WireSizes As WireSizeSet
	Get
```

Visual C++
---
```text
public:
property WireSizeSet^ WireSizes {
	WireSizeSet^ get ();
}
```

# See Also
TemperatureRatingType Class
Autodesk.Revit.DB.Electrical Namespace